"""
  По теме: Строки
"""
"""
1) Напишите программу, которая будет запрашивать пользовательские данные: имя, фамилию, возраст. Далее программа должна проделать следующие операции: в имени убрать все буквы ‘a’(если они есть), в фамилии - разделить все буквы разделителем *. В конце программа выдает вам объединенную строку, состоящую из полученных имени и фамилии, при этом данная строка должна повторяться столько раз, сколько составляет возраст пользователя.

Например:
Ввод: Введите имя, фамилию и возраст через пробел: John Snow 4
Вывод: JоhnS*n*o*wJоhnS*n*o*wJоhnS*n*o*wJоhnS*n*o*w

"""
#писать код здесь
name = input("Введите Фамилию,Имя и возраст через пробел: ")
all_info = name.split()
step1 = all_info[0].replace("a", '')
step2 = (all_info[1][::1])
print(step1, step2)





"""
2) Напишите программу, которая высчитывает количество гласных букв в введенной пользователем строке. И программа выдает вам следующее предложение: В вашей строке насчитано n гласных букв.

Например:
Ввод: Введите строку: I love Makers Bootcamp!
Вывод: В вашей строке насчитано 8 гласных букв

Примечание: не использовать конкатенацию

"""
#писать код здесь
user = input("Введите в строку предложение: ")
vowels = set("EYUIOAeyuioa")
count = 0.
for letter in user:
  if letter in vowels:
    count += 1.
print("Количество гласных равно:")
print(count)


"""
3) Напишите программу, которая просит пользователя ввести свой юзернейм (одним словом) и генерирует пароль из юзернейма, добавив в конец строки символ $, в середину символ &, и заменив строчные буквы на заглавные и наоборот.

Например:
Ввод: Введите юзернейм: JohnSnow
Вывод: Вам сгенерирован пароль: jOHN&sNOW$
"""
username = input("enter your username: ")
password = username.swapcase()
username1 = len(username) + 1 
part_1 = username[0:username1//2]
part_2 = username[username1//2:]
part_3 = part_1 + "&" + part_2
dollar = "$"
print("Вам сгенерирован пароль: ", dollar + password)


# username = input("enter your username: ")
# username1 = len(username) + 1 
# part_1 = username[0:username1//2]
# part_2 = username[username1//2:]
# part_3 = part_1 + "&" + part_2
# print (part_3)
