"""
  По теме: Логические и условные Операторы
"""
"""
1) Создайте программу, которая будет требовать пароль и проверять, содержатся ли в нем только числа, при этом длина пароля не должна быть менее 8 символов . Если все эти условия выполняются, то программа выдает вам сообщение ‘Ваш пароль сохранен’, если же нет - то программа должна указать необходимое условие для сохранения вашего пароля.

Например:
Ввод: Введите пароль: Makers12345
Вывод: Ваш пароль должен хранить только числа

Ввод: Введите пароль: a12345
Вывод: Ваш пароль должен содержать не менее 8 символов
Ваш пароль должен содержать только буквы

"""
user = input("Введите пароль: ")
if
"""
2) Напишите программу, которая должна рассчитывать средний балл по следующим предметам: математике, английскому языку и литературе. Проходной балл составляет более 69 баллов. Если ученик набрал проходной балл, то ему выдается сообщение о том, что он допущен к экзаменам. Если он не набрал нужное количество баллов, то ему выдается сообщение о том, что у него недопуск к экзаменам.

Например: 
Ввод: Введите свои баллы по математике, английскому языку и литературе через запятую: 78, 90, 67
Вывод: Вы допущены к экзаменам. Ваш средний балл составляет 78.3 

"""
#писать код здесь
"""
3) Напишите мини-игру Камень-Ножницы-Бумага. Вы играете с компьютером. Для этого используйте встроенный модуль random.

Например:
Ввод: Ваш выбор: Камень
Выбор компьютера: Ножницы
Вывод: Вы выиграли!

Ввод: Ваш выбор: Бумага
Выбор компьютера: Ножницы
Вывод: Вы проиграли!
"""
#писать код здесь
fiouriograiogrj
rifhreiofhreiofhre'iohgeifj
ofjreifjri